// world.c
inherit ROOM;

varargs void create(int x, int y, int z)
{
    set("short", "我的世界 - 坐标(" + x + "," + y + "," + z + ")");
    set("long", @LONG
    这里是玩家自己创造的世界地区，荒无人烟，一切都还在建设中凸^-^凸
    .__                                             .__       .___
    |  |__   ____   _____   ______  _  _____________|  |    __| _/
    |  |  \ /  _ \ /     \_/ __ \ \/ \/ /  _ \_  __ \  |   / __ |
    |   Y  (  <_> )  Y Y  \  ___/\     (  <_> )  | \/  |__/ /_/ |
    |___|  /\____/|__|_|  /\___  >\/\_/ \____/|__|  |____/\____ |
        \/             \/     \/                              \/
LONG);

    set("exits", ([
        "north":__DIR__ "world/" + x + "," + (y + 1) + "," + z,
        "south":__DIR__ "world/" + x + "," + (y - 1) + "," + z,
        "west":__DIR__ "world/" + (x - 1) + "," + y + "," + z,
        "east":__DIR__ "world/" + (x + 1) + "," + y + "," + z,
    ]));
}
