int main(object me, string arg)
{
    string help = @HELP
        _        _______  _______   _________ _______  _______ _________
       ( \      (  ____ )(  ____ \  \__   __/(  ____ \(  ____ \\__   __/
       | (      | (    )|| (    \/     ) (   | (    \/| (    \/   ) (
       | |      | (____)|| |           | |   | (__    | (_____    | |
       | |      |  _____)| |           | |   |  __)   (_____  )   | |
       | |      | (      | |           | |   | (            ) |   | |
       | (____/\| )      | (____/\     | |   | (____/\/\____) |   | |
       (_______/|/       (_______/     )_(   (_______/\_______)   )_(
    ---------------------------------------------------------------------
    ＬＰＣ－ＴＥＳＴ使用指南，当你什么都不能用时请输入 tutorial 根据提示体验游戏。
    当你输入 tutorial user 后，解锁更多功能，最主要的是可以直接使用 efun 目录下的
指令，也可以直接运行 demo 目录下的示例。具体有哪些指令和示例可以输入以下指令查看：
    get_dir cmds/efun 和 get_dir cmds/demo

HELP;

    write(help);

    return 1;
}
